# Handling missing values - Isnull & notnull

In [4]:
import pandas as pd

In [5]:
df_na = pd.read_csv("./datasets/df_na.csv")

In [6]:
df_na

       Name  Score Grades
0      Paul   98.0    NaN
1     Aaron    NaN     AB
2    Krista   99.0     AA
3  Veronica   87.0    NaN
4    Paxton   90.0     AC
5   Madison    NaN     BA
6    Aurora   82.0     BB

## 1. Find total number of missing values using `isnull()`

In [7]:
df_na.isnull()

    Name  Score  Grades
0  False  False    True
1  False   True   False
2  False  False   False
3  False  False    True
4  False  False   False
5  False   True   False
6  False  False   False

In [9]:
df_na.isnull().sum()

Name      0
Score     2
Grades    2
dtype: int64

In [10]:
df_na.isnull().sum().sum()

4

## 2. Using `isna()`

In [13]:
df_na.isna()

    Name  Score  Grades
0  False  False    True
1  False   True   False
2  False  False   False
3  False  False    True
4  False  False   False
5  False   True   False
6  False  False   False

In [14]:
df_na.isna().sum().sum()

4

## 3. `notnull()`

Not null is exactly the opposite of isnull which is a method to find non null values

In [15]:
df_na.notnull()

   Name  Score  Grades
0  True   True   False
1  True  False    True
2  True   True    True
3  True   True   False
4  True   True    True
5  True  False    True
6  True   True    True

In [16]:
df_na.notnull().sum()

Name      7
Score     5
Grades    5
dtype: int64

## 4. Checking null/non null values in a column

In [17]:
type(df_na["Score"])

pandas.core.series.Series

In [20]:
df_na[df_na["Score"].isnull()]

      Name  Score Grades
1    Aaron    NaN     AB
5  Madison    NaN     BA

In [21]:
df_na[df_na["Score"].notnull()]

       Name  Score Grades
0      Paul   98.0    NaN
2    Krista   99.0     AA
3  Veronica   87.0    NaN
4    Paxton   90.0     AC
6    Aurora   82.0     BB